prathapreddy4023/prared/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/WRISTBAND/Nrf51422-V2/Board/pca10001/s110/ble_app_hrs/main.c
static app_timer_id_t                        m_battery_timer_id;                       /**< Battery timer. */
static app_timer_id_t                        m_heart_rate_timer_id;                    /**< Heart rate measurement timer. */
static app_timer_id_t                        m_square_wave_timer_id;
static bool                                  m_storage_in_progress = false;            /**< Indicates storage access is ongoing or not. */
static bool                                  m_sys_off_pending     = false;            /**< Indicates system off is pending or not. */
#define SQUARE_WAVE_PIN_NO_1               		21                                      /**< Is on when device is advertising. */

static void ble_evt_dispatch(ble_evt_t * p_ble_evt);

static void sys_evt_dispatch(uint32_t sys_evt);

uint8_t adc_sample[512]={0x00};
uint16_t adc_index=0;
bool ON_Demand_request_data=false;
bool square_flag=false;
void ADC_value(void)
{
    nrf_adc_conversion_event_clean();
		//nrf_adc_start();
  	adc_sample[adc_index]  = nrf_adc_result_get();
		adc_index++;
	  if(adc_index >= 512)
		{
			adc_index=0;
		}
    // trigger next ADC conversion
    nrf_adc_start();
}
void adc_config(void)
{
    const nrf_adc_config_t nrf_adc_config = NRF_ADC_CONFIG_DEFAULT;

    // Initialize and configure ADC
    nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
    nrf_adc_input_select(NRF_ADC_CONFIG_INPUT_2);
   // nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
//    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);
//    NVIC_EnableIRQ(ADC_IRQn);
}
void square_wave_timer_start()
{
	uint32_t err_code;
  err_code = app_timer_start(m_square_wave_timer_id, SQURE_WAVE_MEAS_INTERVAL, NULL);
  APP_ERROR_CHECK(err_code);
}
__inline static void gpiote_1_init(void)
{
			APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);	
			nrf_gpiote_task_config(0,21, NRF_GPIOTE_POLARITY_TOGGLE, \
                           NRF_GPIOTE_INITIAL_VALUE_LOW);
		
}
static void timer2_init(void)
{
    /* Start 16 MHz crystal oscillator */
    NRF_CLOCK->EVENTS_HFCLKSTARTED    = 0;
    NRF_CLOCK->TASKS_HFCLKSTART       = 1;
    /* Wait for the external oscillator to start up */
    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0)       
    {
        // Do nothing.
    }
		
		
		NRF_TIMER2->TASKS_CLEAR = 1;
    NRF_TIMER2->MODE        = TIMER_MODE_MODE_Timer;
		NRF_TIMER2->PRESCALER   = 2; // 1MHz

    /* Load initial values to Timer 2 CC registers */
    /* Set initial CC0 value to anything > 1 */
		
		NRF_TIMER2->CC[0] = 1;
		NRF_TIMER2->CC[1] = 2;
  
		NRF_TIMER2->BITMODE   = TIMER_BITMODE_BITMODE_16Bit;
		
}


static void ppi_1_init(void)
{
    uint32_t err_code;

	 err_code = sd_ppi_channel_assign(0,
                                     &(NRF_TIMER2->EVENTS_COMPARE[0]),
                                     &(NRF_GPIOTE->TASKS_OUT[0]));
    APP_ERROR_CHECK(err_code);
	
		err_code = sd_ppi_channel_assign(1,
                                      &(NRF_TIMER2->EVENTS_COMPARE[1]),
                                     &(NRF_GPIOTE->TASKS_OUT[0]));
    APP_ERROR_CHECK(err_code);
	
	
		err_code = sd_ppi_channel_assign(2,
                                     &(NRF_TIMER2->EVENTS_COMPARE[1]),
                                     &(NRF_TIMER2->TASKS_CLEAR));
    APP_ERROR_CHECK(err_code);
	
		
    // Enable PPI channel 0 
}
__inline static void square_wave_init(void)
{
	nrf_gpio_cfg_output(SQUARE_WAVE_PIN_NO_1);
}

void ppi_enable()
{
	uint32_t err_code;
	err_code = sd_ppi_channel_enable_set( (PPI_CHEN_CH0_Msk) | (PPI_CHEN_CH1_Msk)| (PPI_CHEN_CH2_Msk));
    APP_ERROR_CHECK(err_code);
}
void ppi_disable()
{
	uint32_t err_code;
	err_code = sd_ppi_channel_enable_clr( (PPI_CHEN_CH0_Msk) | (PPI_CHEN_CH1_Msk)| (PPI_CHEN_CH2_Msk));
    APP_ERROR_CHECK(err_code);
}

void square_wave_start(void)
{
		ppi_enable();
    NRF_TIMER2->TASKS_START = 1;
}


void square_wave_stop(void)
{
    // Disable the GPIOTE_CHAN_FOR_LED_TASK. This is because when an task has been configured
    // to operate on a pin, the pin can only be written from GPIOTE module. Attempting to write a
    // pin (using nrf_gpio_pin_clear() below for example) as a normal GPIO pin will have no effect.
    ppi_disable();
    NRF_TIMER2->TASKS_STOP = 1;
    nrf_gpio_pin_set(SQUARE_WAVE_PIN_NO_1);
}

/*****************************************************************************
* Error Handling Functions
*****************************************************************************/


/**@brief Function for error handling, which is called when an error has occurred. 
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name. 
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling a Bond Manager error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void bond_manager_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/*****************************************************************************
* Static Timeout Handling Functions
*****************************************************************************/

