prathapreddy4023/prared/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/WRISTBAND/Nrf51422-V2/Board/pca10001/s110/ble_app_hrs/main.c
    err_code = app_timer_stop(m_heart_rate_timer_id );
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_start(&m_adv_params);
    APP_ERROR_CHECK(err_code);

    //square_wave_start();
}


/**@brief Function for putting the chip in System OFF Mode
 */
static void system_off_mode_enter(void)
{
    uint32_t err_code; 
    
    if (m_storage_in_progress)
    {
        m_sys_off_pending = true;    
    }
    else
    {
        err_code = sd_power_system_off();
        APP_ERROR_CHECK(err_code);
    }
}


/*****************************************************************************
* Static Event Handling Functions
*****************************************************************************/

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t        err_code;
    static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            square_wave_stop();
            
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            
            // Initialize the current heart rate to the average of max and min values. So that
            // everytime a new connection is made, the heart rate starts from the same value.
           //m_cur_heart_rate = (MAX_HEART_RATE + MIN_HEART_RATE) / 2;

            // Start timers used to generate battery and HR measurements.
						//application_timers_start();

            // Start handling button presses
						application_timers_stop();
//            err_code = app_button_enable();
//            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            // Since we are not in a connection and have not started advertising, store bonds
            err_code = ble_bondmngr_bonded_centrals_store();
            APP_ERROR_CHECK(err_code);
            
            m_storage_in_progress = true;
        
            // @note Flash access may not be complete on return of this API. System attributes are now
            // stored to flash when they are updated to ensure flash access on disconnect does not
            // result in system powering off before data was successfully written.

            // Go to system-off mode, should not return from this function, wakeup will trigger
            // a reset.
            //system_off_mode_enter();
						advertising_start();
						application_timers_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, 
                                                   BLE_GAP_SEC_STATUS_SUCCESS, 
                                                   &m_sec_params);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_TIMEOUT:
//            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
//            {
//                led_stop();
//                
//                nrf_gpio_cfg_sense_input(HR_INC_BUTTON_PIN_NO,
//                                         BUTTON_PULL, 
//                                         NRF_GPIO_PIN_SENSE_LOW);

//                nrf_gpio_cfg_sense_input(HR_DEC_BUTTON_PIN_NO,
//                                         BUTTON_PULL, 
//                                         NRF_GPIO_PIN_SENSE_LOW);

//                system_off_mode_enter();
//            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
	  ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    ble_bondmngr_on_ble_evt(p_ble_evt);
    ble_hrs_on_ble_evt(&m_hrs, p_ble_evt);
    ble_bas_on_ble_evt(&bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    on_ble_evt(p_ble_evt);
			if(p_ble_evt->header.evt_id==BLE_GATTS_EVT_WRITE)
		{
				if(p_evt_write->handle==0x0E)
				{
					if(p_evt_write->data[0]==0x31)
					{
						nrf_gpio_cfg_output(22); 
						 nrf_gpio_pin_clear(22);
						ON_Demand_request_data=true;
					}
					 
				}
	  }
}


/**@brief Handler for doing post actions on storage access complete 
*/
static void storage_access_complete_handler(void)
{
    uint32_t err_code;
    
    m_storage_in_progress = false;
    
    if (m_sys_off_pending == true)
    {
        err_code = sd_power_system_off();
        APP_ERROR_CHECK(err_code);
    }
}
    

/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);

    uint32_t count;
    uint32_t err_code;

    // Check if storage access is in progress.
    err_code = pstorage_access_status_get(&count);
    if ((err_code == NRF_SUCCESS) && (count == 0))
    {
        storage_access_complete_handler();
    }
}

/*****************************************************************************
* Main Function
*****************************************************************************/

/**@brief Function for the application main entry.
 */
int main(void)
{
    uint32_t err_code;

		square_wave_init();
    gpiote_1_init();
		timers_init();
	  timer2_init(); 

    //gpiote1_init();
    buttons_init();
    ble_stack_init();
		ppi_1_init();
    bond_manager_init();
		adc_config();
	
    // Initialize Bluetooth Stack parameters
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start advertising
    advertising_start();
    nrf_adc_start();
		 
		application_timers_start();
		 
    // Enter main loop
    for (;;)
    {
			 if(ON_Demand_request_data == true)
				{
							uint32_t i=0,j=0,k=0,m=0;
							i=adc_index/20;
							j=adc_index%20;
							for(k=0;k<i;k++)
							{
									err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, 20, &adc_sample[m]);

									if (
											(err_code != NRF_SUCCESS)
											&&
											(err_code != NRF_ERROR_INVALID_STATE)
											&&
											(err_code != BLE_ERROR_NO_TX_BUFFERS)
											&&
											(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
									)
									{
											APP_ERROR_HANDLER(err_code);
									}
									m=m+20;
							}
							err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, j, &adc_sample[m]);
							if (
											(err_code != NRF_SUCCESS)
											&&
											(err_code != NRF_ERROR_INVALID_STATE)
											&&
											(err_code != BLE_ERROR_NO_TX_BUFFERS)
											&&
											(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
									)
									{
											APP_ERROR_HANDLER(err_code);
									}
									 
									ON_Demand_request_data=false;
									m=i=j=k=0;
				 }
				 if(square_flag==true)
				 {
//						nrf_gpio_cfg_output(24); 
//						nrf_gpio_pin_toggle(24);
  						ADC_value();
//						square_wave_stop();
							square_flag=false;
				}
				 
        // Switch to a low power state until an event is available for the application
        err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    }
}

/**
 * @}
 */
